funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
#ifdef ENABLE_ISPPROG
// DEFINE 3 LEDS INDICATORS FOR THE ISP PROGRAMMER
// TODO: To change the Heart Beat LED assignment because it must be a PWM channel!!!
#if defined(__AVR_ATmega16__)      || \
	defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega32A__)     || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__)
//pinMode(LED_PMODE, OUTPUT);
#define LED_HB    PD5 // LED HEART BEAT
#define LED_ERR   PC6 // LED ERROR
#define LED_PMODE PC7 // LED PROGRAMMING MODE
#define RESET     PB2
//--
#define LED_HB_PORT    PORTD
#define LED_ERR_PORT   PORTC
#define LED_PMODE_PORT PORTC
#define RESET_PORT     PORTB
//--
#define LED_HB_DDR    DDRD
#define LED_ERR_DDR   DDRC
#define LED_PMODE_DDR DDRC
#define RESET_DDR     DDRB
//--
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__) // Arduino Mega1280
#define LED_HB    PC6 // LED HEART BEAT
#define LED_ERR   PD5 // LED ERROR
#define LED_PMODE PC7 // LED PROGRAMMING MODE
#define RESET     PB2
//--
#define LED_HB_PORT    PORTC
#define LED_ERR_PORT   PORTD
#define LED_PMODE_PORT PORTC
#define RESET_PORT     PORTB
//--
#define LED_HB_DDR    DDRC
#define LED_ERR_DDR   DDRD
#define LED_PMODE_DDR DDRC
#define RESET_DDR     DDRB
//--
#elif defined(__AVR_ATmega48__)    || \
    defined(__AVR_ATmega88__)      || \
    defined(__AVR_ATmega88P__)     || \
    defined(__AVR_ATmega168__)     || \
    defined(__AVR_ATmega168P__)    || \
    defined(__AVR_ATmega328P__)   // Arduino 28 pins
#define LED_HB    PB1 // LED HEART BEAT
#define LED_ERR   PB0 // LED ERROR
#define LED_PMODE PD7 // LED PROGRAMMING MODE
#define RESET     PB2
//--
#define LED_HB_PORT    PORTB
#define LED_ERR_PORT   PORTB
#define LED_PMODE_PORT PORTD
#define RESET_PORT     PORTB
//--
#define LED_HB_DDR    DDRB
#define LED_ERR_DDR   DDRB
#define LED_PMODE_DDR DDRD
#define RESET_DDR     DDRB
//--
#endif
#endif // ENABLE_ISPPROG
// Continue with user settings, and chose your values...
//------------------------
// I2C port and pin selection - at your choice.
//------------------------
#ifdef ENABLE_I2C_SOFTWARE
#define I2C_PORT PORTC	//port for I2C line (PORTC)
#define I2C_SDA  PC1 	//pin  for SDA line (PC1)
#define I2C_SCL  PC0	  //pin  for SCL line (PC0)
#endif

#ifdef ENABLE_TWI
#include <compat/twi.h>
// Note1: When you enable TWI, it disconnects from the normal I/O driver
// and uses the open drain automatically.
// Note2: The AVR TWI is byte-oriented and interrupt based...
#define TWI_STANDARD_SPEED  100000UL // - don't change
#define TWI_FAST_SPEED      400000UL // - don't change
// change TWI_FREQ according to your settings
#define TWI_FREQ TWI_STANDARD_SPEED
#endif //ENABLE_TWI
//--
#if defined(ENABLE_SERIAL)// interrupt based
#define UART_BUFFER_SIZE  64 // buffer size for USART RX (receiving)
// change it to your needs (16, 32, 64, 128)
#endif

// chose the timer if your microcontroller allows that.
#ifdef ENABLE_FREQMEASURE
// Arduino Uno, Duemilanove, LilyPad, Mini, Fio, etc
#if defined(__AVR_ATmega48__)    || \
	    defined(__AVR_ATmega88__)      || \
	    defined(__AVR_ATmega88P__)     || \
	    defined(__AVR_ATmega168__)     || \
	    defined(__AVR_ATmega168P__)    || \
	    defined(__AVR_ATmega328P__)
#define CAPTURE_USE_TIMER1       // ICP1 is pin 8 (PB0)
// Teensy 1.0
#elif defined(__AVR_AT90USB162__)
#define CAPTURE_USE_TIMER1       // ICP1 is pin 16
// Teensy 2.0
#elif defined(__AVR_ATmega32U4__)
// #define CAPTURE_USE_TIMER1    // ICP1 is pin 22
#define CAPTURE_USE_TIMER3       // ICP3 is pin 10
// Teensy++ 1.0 & 2.0
#elif defined(__AVR_AT90USB646__) || defined(__AVR_AT90USB1286__) || defined(__AVR_AT90USB1287__)
// #define CAPTURE_USE_TIMER1    // ICP1 is pin 4
#define CAPTURE_USE_TIMER3       // ICP3 is pin 17
// Sanguino
#elif defined(__AVR_ATmega16__)      || \
		defined(__AVR_ATmega16A__)     || \
	    defined(__AVR_ATmega164P__)    || \
	    defined(__AVR_ATmega32__)      || \
	    defined(__AVR_ATmega32A__)     || \
	    defined(__AVR_ATmega324P__)    || \
	    defined(__AVR_ATmega324PA__)   || \
	    defined(__AVR_ATmega644__)     || \
	    defined(__AVR_ATmega644P__)    || \
	    defined(__AVR_ATmega1284P__)
#define CAPTURE_USE_TIMER1       // ICP1 is pin 14 (PD6)
// Arduino Mega
#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
// #define CAPTURE_USE_TIMER1    // ICP1 is not connected
// #define CAPTURE_USE_TIMER3    // ICP3 is not connected
#define CAPTURE_USE_TIMER4       // ICP4 is pin 49
// #define CAPTURE_USE_TIMER5    // ICP5 is pin 48

#else
#error "Unknown chip, please edit me with timer+counter definitions"

#endif
#endif //ENABLE_FREQMEASURE
//--
#ifdef ENABLE_SD_CARD
#ifndef ENABLE_SPI
#error "This needs SPI so, uncomment ENANBLE_SPI from the library header"
#endif
//define the pin used for CS (chip select) the SD Card
//it can be the SPI SS pin if you want (recommended if SD is the first SPI peripheral)
//default is set for atmega168p/328p (PB2) but it is an ongoing project,
//tested with different micro controllers so, the settings can vary from a
// SVN update to another...
#define SD_CS_DDR  DDRB
#define SD_CS_PORT PORTB
#define SD_CS_PIN  PB4
#endif //ENABLE_SD_CARD
//--
#ifdef ENABLE_FAT32
#ifndef ENABLE_SPI
#error "This needs SPI so, uncomment ENANBLE_SPI from the library header"
#endif
#ifndef ENABLE_SD_CARD
#error "This needs SD_CARD so, uncomment ENANBLE_SD_CARD from the library header"
#endif
#define MAX_STRING_SIZE     100 //defining the maximum size of the dataString
#endif //ENABLE_FAT32
//set 1 wire pin
#ifdef ENABLE_ONE_WIRE
// Define OW_ONE_BUS if only one 1-Wire-Bus is used
// in the application -> shorter code.
// If not defined make sure to call ow_set_bus() before using
// a bus. Runtime bus-select increases code size by around 300
// bytes so use OW_ONE_BUS if possible
#define OW_ONE_BUS

#ifdef OW_ONE_BUS
#define OW_PIN  PC5
#define OW_IN   PINC
#define OW_DDR  DDRC
#define OW_OUT  PORTC
#define OW_CONF_DELAYOFFSET 0

#else

