funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
#if ( F_CPU < 1843200 )
#warning | Experimental multi-bus-mode is not tested for
#warning | frequencies below 1,84MHz. Use OW_ONE_WIRE or
#warning | faster clock-source (i.e. internal 2MHz R/C-Osc.).
#endif
#define OW_CONF_CYCLESPERACCESS 13
#define OW_CONF_DELAYOFFSET ( (uint16_t)( ((OW_CONF_CYCLESPERACCESS) * 1000000L) / F_CPU ) )
#endif //OW_ONE_BUS
// Recovery time (T_Rec) minimum 1usec - increase for long lines
// 5 usecs is a value give in some Maxim AppNotes
// 30u secs seem to be reliable for longer lines
//#define OW_RECOVERY_TIME        5  // usec
//#define OW_RECOVERY_TIME       30 // usec
#define OW_RECOVERY_TIME         10 // usec
// Use AVR's internal pull-up resistor instead of external 4,7k resistor.
// Based on information from Sascha Schade. Experimental but worked in tests
// with one DS18B20 and one DS18S20 on a rather short bus (60cm), where both
// sensors have been parasite-powered.
#define OW_USE_INTERNAL_PULLUP    0  // 0=external, 1=internal
//
#ifdef ENABLE_DS18_2_
// DS18x20 EERPROM support disabled(0) or enabled(1) :
#define DS18X20_EEPROMSUPPORT     0
// decicelsius functions disabled(0) or enabled(1):
#define DS18X20_DECICELSIUS       1
// max. resolution functions disabled(0) or enabled(1):
#define DS18X20_MAX_RESOLUTION    0
// extended output via UART disabled(0) or enabled(1) :
#define DS18X20_VERBOSE           0 //require serial comm.
#endif //ENABLE_DS18_2_
#endif //ENABLE_ONE_WIRE
//
#ifdef ENABLE_LCD
// Define the specific ports and pins used for the LCD
#define LCD_D4_PORT PORTD
#define LCD_D4_DDR DDRD
#define LCD_D4_PIN PD4

#define LCD_D5_PORT PORTD
#define LCD_D5_DDR DDRD
#define LCD_D5_PIN PD5

#define LCD_D6_PORT PORTD
#define LCD_D6_DDR DDRD
#define LCD_D6_PIN PD6

#define LCD_D7_PORT PORTD
#define LCD_D7_DDR DDRD
#define LCD_D7_PIN PD7

#define LCD_E_PORT PORTD
#define LCD_E_DDR DDRD
#define LCD_E_PIN PD3

#define LCD_RS_PORT PORTD
#define LCD_RS_DDR DDRD
#define LCD_RS_PIN PD2

//Define the wanted LCD type (only one line can be active at a time):
//#define LCD_1X8
//#define LCD_1X16
//#define LCD_1X20
//#define LCD_1X40
//#define LCD_2X8       // some 1x16 are wired as 2x8
//#define LCD_2X12
#define LCD_2X16
//#define LCD_2X20
//#define LCD_2X24
//#define LCD_2X40
//#define LCD_4X16
//#define LCD_4X20
#endif //ENABLE_LCD
//--
#ifdef ENABLE_GLCD
// define which ports are allocated for your graphic LCD
// You need two full ports for this!

// Included some changes for future additions, as separate settings for
// individual pins but don't touch that yet!!!
#define GLCD_CMD_PORT   PORTA		// Command Output Register
// THE FOLLWOING ARE NOT IMPLEMENTED YET, DON'T USE
// here goes the settings for every pin if maximum flexibility is desired
// #define GLCD_CMD_PORT_D_I
// #define GLCD_CMD_PORT_RW
// #define GLCD_CMD_PORT_EN
// #define GLCD_CMD_PORT_CSEL1
// #define GLCD_CMD_PORT_CSEL2

#define GLCD_CMD_DIR    DDRA		// Data Direction Register for Command Port
// THE FOLLWOING ARE NOT IMPLEMENTED YET, DON'T USE
// here goes the settings for every pin if maximum flexibility is desired
// #define GLCD_CMD_DIR_D_I
// #define GLCD_CMD_DIR_RW
// #define GLCD_CMD_DIR_EN
// #define GLCD_CMD_DIR_CSEL1
// #define GLCD_CMD_DIR_CSEL2

#define GLCD_DATA_IN    PINC		// Data Input Register
// THE FOLLWOING ARE NOT IMPLEMENTED YET, DON'T USE
// here goes the settings for every pin if maximum flexibility is desired
// #define GLCD_DATA_IN_0
// #define GLCD_DATA_IN_1
// #define GLCD_DATA_IN_2
// #define GLCD_DATA_IN_3
// #define GLCD_DATA_IN_4
// #define GLCD_DATA_IN_5
// #define GLCD_DATA_IN_6
// #define GLCD_DATA_IN_7

#define GLCD_DATA_OUT   PORTC		// Data Output Register
// THE FOLLWOING ARE NOT IMPLEMENTED YET, DON'T USE
// here goes the settings for every pin if maximum flexibility is desired
// #define GLCD_DATA_OUT_0
// #define GLCD_DATA_OUT_1
// #define GLCD_DATA_OUT_2
// #define GLCD_DATA_OUT_3
// #define GLCD_DATA_OUT_4
// #define GLCD_DATA_OUT_5
// #define GLCD_DATA_OUT_6
// #define GLCD_DATA_OUT_7

#define GLCD_DATA_DIR   DDRC		// Data Direction Register for Data Port
// THE FOLLWOING ARE NOT IMPLEMENTED YET, DON'T USE
// here goes the settings for every pin if maximum flexibility is desired
// #define GLCD_DATA_DIR_0
// #define GLCD_DATA_DIR_1
// #define GLCD_DATA_DIR_2
// #define GLCD_DATA_DIR_3
// #define GLCD_DATA_DIR_4
// #define GLCD_DATA_DIR_5
// #define GLCD_DATA_DIR_6
// #define GLCD_DATA_DIR_7

// Command Port Bits
#define GLCD_D_I        0x00		// D/I Bit Number
#define GLCD_R_W        0x01		// R/W Bit Number
#define GLCD_EN         0x02		// EN Bit Number
#define GLCD_CSEL1      0x03		// CS1 Bit Number
#define GLCD_CSEL2      0x04		// CS2 Bit Number
#endif //ENABLE_GLCD
//--
#ifdef ENABLE_7SEG
// Define delay in microseconds between digits selection to avoid ghost effect
#define SEG_DELAY 1500
// Define the type of 7seg (common anode or common cathode)
#define SEG_COMMON_ANODE // comment this for common cathode type
//select the type of 7seg display (how many digits you have/use)
//must be the same as the buffer size (SEG_DIGITS_BUFFER[])
#define SEG_DIGITS_1 1
//#define SEG_DIGITS_2 2
//#define SEG_DIGITS_3 3
//#define SEG_DIGITS_4 4
//#define SEG_DIGITS_5 5
//#define SEG_DIGITS_6 6
//#define SEG_DIGITS_7 7
//#define SEG_DIGITS_8 8
// Define buffer for how many digits you have/are going to use
uint8_t SEG_DIGITS_BUFFER[1];

// Define the specific ports and pins used for the 7 segment display
// Default is for Arduino UNO or Severino M2 boards
#define SEG_A_PORT PORTD
#define SEG_A_DDR DDRD
#define SEG_A_PIN PD2

#define SEG_B_PORT PORTD
#define SEG_B_DDR DDRD
#define SEG_B_PIN PD3

#define SEG_C_PORT PORTD
#define SEG_C_DDR DDRD
#define SEG_C_PIN PD4

#define SEG_D_PORT PORTD
#define SEG_D_DDR DDRD
#define SEG_D_PIN PD5

#define SEG_E_PORT PORTD
#define SEG_E_DDR DDRD
#define SEG_E_PIN PD6

#define SEG_F_PORT PORTD
#define SEG_F_DDR DDRD
#define SEG_F_PIN PD7

#define SEG_G_PORT PORTB
#define SEG_G_DDR DDRB
#define SEG_G_PIN PB2

// comment/uncomment the following 3 lines if you use/don't use the dot(DP) indicator
// don't forget to edit them according to your hardware settings.
#define SEG_DP_PORT PORTB
#define SEG_DP_DDR DDRB
#define SEG_DP_PIN PB1

//Now, definitions for common pin (cathode or anode)
//Disable or Enable definitions, according with how many 7seg. digits you have
//Of course, you must change definitions according to your hardware connections
#define SEG_COMM_0_PORT PORTC
#define SEG_COMM_0_DDR DDRC
#define SEG_COMM_0_PIN PC2

