funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
//#define SEG_COMM_1_PORT PORTC
//#define SEG_COMM_1_DDR DDRC
//#define SEG_COMM_1_PIN PC3

//#define SEG_COMM_2_PORT PORTC
//#define SEG_COMM_2_DDR DDRC
//#define SEG_COMM_2_PIN PC4

//#define SEG_COMM_3_PORT PORTC
//#define SEG_COMM_3_DDR DDRC
//#define SEG_COMM_3_PIN PC5

//#define SEG_COMM_4_PORT PORT
//#define SEG_COMM_4_DDR DDR
//#define SEG_COMM_4_PIN P

//#define SEG_COMM_5_PORT PORT
//#define SEG_COMM_5_DDR DDR
//#define SEG_COMM_5_PIN P

//#define SEG_COMM_6_PORT PORT
//#define SEG_COMM_6_DDR DDR
//#define SEG_COMM_6_PIN P

//#define SEG_COMM_7_PORT PORT
//#define SEG_COMM_7_DDR DDR
//#define SEG_COMM_7_PIN P

#endif
//--
#ifdef ENABLE_PCF8583
// set the PCF8583 address and which I2C it use...
#define PCF8583_USE_TWI // disable if you want to use the software I2C
#define PCF8583_A0 0;          // relative base address, let it be
#define Physical_Address 0xA2; // On EVB board, the address for PCF is 0xA2
// - set to 0xA0 if pin A0 of PCF8583 is connected to GND
// - set to 0xA2 if pin A0 of PCF8583 is connected to VCC
#endif
//--
#ifdef ENABLE_RFM12B
#ifndef ENABLE_SPI
#error "This needs SPI so, uncomment ENANBLE_SPI from the library header"
#endif
// Enable (regarding to your freq.) only one of the following two definitions
//#define RF_FREQ_868MHz 1
#define RF_FREQ_433MHz 1

// Define the CS pin for RFM12B module
// (check if it conflicts with SD card or any other SPI module)
#define RF_CS_DDR  DDRB
#define RF_CS_PORT PORTB
#define RF_CS_PIN  PB4
//define activity LEDs (disable them if you don't have available pins)
#define GREEN_LED_DDR  DDRB
#define GREEN_LED_PORT PORTB
#define GREEN_LED_PIN  PB4

#define RED_LED_DDR  DDRB
#define RED_LED_PORT PORTB
#define RED_LED_PIN  PB4

#endif //ENABLE_RFM12B
//--
#ifdef ENABLE_GPL_RFM12B
/******************************************************
 *                                                    *
 *           C O N F I G U R A T I O N                *
 *                                                    *
 ******************************************************/

/*
 Connect the RFM12 to the AVR as follows:

 RFM12           | AVR
 ----------------+------------
 SDO             | MISO
 nIRQ            | INT0
 FSK/DATA/nFFS   | VCC
 DCLK/CFIL/FFIT  |  -
 CLK             |  -
 nRES            |  -
 GND             | GND
 ANT             |  -
 VDD             | VCC
 GND             | GND
 nINT/VDI        | -
 SDI             | MOSI
 SCK             | SCK
 nSEL            | Slave select pin defined below RF_BIT_SS, etc...
 */

/************************
 * RFM12 PIN DEFINITIONS
 */

//Pin that the RFM12's slave select is connected to
#define RF_DDR_SS DDRC
#define RF_PORT_SS PORTC
#define RF_BIT_SS 3

//SPI setup
// - we don't need this part, as we have our SPI functions

/************************
 * RFM12 CONFIGURATION OPTIONS
 */

//baseband of the module (either RFM12_BAND_433, RFM12_BAND_868 or RFM12_BAND_912)
#define RFM12_BASEBAND RFM12_BAND_433

//center frequency to use (+- FSK frequency shift)
#define RFM12_FREQUENCY       433170000UL

//Transmit FSK frequency shift in kHz
#define FSK_SHIFT             125000

//Receive RSSI Threshold
#define RFM12_RSSI_THRESHOLD  RFM12_RXCTRL_RSSI_79

//Receive Filter Bandwidth
#define RFM12_FILTER_BW       RFM12_RXCTRL_BW_400

//Output power relative to maximum (0dB is maximum)
#define RFM12_POWER           RFM12_TXCONF_POWER_0

//Receive LNA gain
#define RFM12_LNA_GAIN        RFM12_RXCTRL_LNA_6

//crystal load capacitance - the frequency can be verified by measuring the
//clock output of RFM12 and comparing to 1MHz.
//11.5pF seems to be o.k. for RFM12, and 10.5pF for RFM12BP, but this may vary.
#define RFM12_XTAL_LOAD       RFM12_XTAL_11_5PF

//use this for datarates >= 2700 Baud
#define DATARATE_VALUE        RFM12_DATARATE_CALC_HIGH(9600.0)

//use this for 340 Baud < datarate < 2700 Baud
//#define DATARATE_VALUE      RFM12_DATARATE_CALC_LOW(1200.0)

//TX BUFFER SIZE
#define RFM12_TX_BUFFER_SIZE  30

//RX BUFFER SIZE (there are going to be 2 Buffers of this size for double_buffering)
#define RFM12_RX_BUFFER_SIZE  30

/************************
 * RFM12 INTERRUPT VECTOR
 * set the name for the interrupt vector here
 */

#if defined(EICRA) && defined(ISC00) && defined(EIMSK)
//the interrupt vector
#define RFM12_INT_VECT (INT0_vect)

//the interrupt mask register
#define RFM12_INT_MSK EIMSK

//the interrupt bit in the mask register
#define RFM12_INT_BIT (INT0)

//the interrupt flag register
#define RFM12_INT_FLAG EIFR

//the interrupt bit in the flag register
#define RFM12_FLAG_BIT (INTF0)

//setup the interrupt to trigger on negative edge
#define RFM12_INT_SETUP()   EICRA |= (1<<ISC11)


#elif defined(MCUCR) && defined(ISC00) && defined(GICR)
//the interrupt vector
#define RFM12_INT_VECT (INT0_vect)

//the interrupt mask register
#define RFM12_INT_MSK GICR

//the interrupt bit in the mask register
#define RFM12_INT_BIT (INT0)

//the interrupt flag register
#define RFM12_INT_FLAG GIFR

//the interrupt bit in the flag register
#define RFM12_FLAG_BIT (INTF0)

//setup the interrupt to trigger on negative edge
#define RFM12_INT_SETUP()   MCUCR |= (1<<ISC11)

#elif defined(MCUCR) && defined(ISC00) && defined(GIMSK)
//the interrupt vector
#define RFM12_INT_VECT (INT0_vect)

//the interrupt mask register
#define RFM12_INT_MSK GIMSK

//the interrupt bit in the mask register
#define RFM12_INT_BIT (INT0)

//the interrupt flag register
#define RFM12_INT_FLAG GIFR

//the interrupt bit in the flag register
#define RFM12_FLAG_BIT (INTF0)

//setup the interrupt to trigger on negative edge
#define RFM12_INT_SETUP()   MCUCR |= (1<<ISC11)


#else
#error "Interrupt not finished for this CPU"
#endif

/************************
 * FEATURE CONFIGURATION
 */

#define RFM12_LIVECTRL 0
#define RFM12_LIVECTRL_CLIENT 0
#define RFM12_LIVECTRL_HOST 0
#define RFM12_LIVECTRL_LOAD_SAVE_SETTINGS 0
#define RFM12_NORETURNS 0
#define RFM12_NOCOLLISIONDETECTION 0
#define RFM12_TRANSMIT_ONLY 0
#define RFM12_SPI_SOFTWARE 0
#define RFM12_USE_POLLING 0
#define RFM12_RECEIVE_ASK 0
#define RFM12_TRANSMIT_ASK 0
#define RFM12_USE_WAKEUP_TIMER 0
#define RFM12_USE_POWER_CONTROL 0
#define RFM12_LOW_POWER 0
#define RFM12_USE_CLOCK_OUTPUT 0
#define RFM12_LOW_BATT_DETECTOR 0

