funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
#define RFM12_LBD_VOLTAGE             RFM12_LBD_VOLTAGE_3V0

#define RFM12_CLOCK_OUT_FREQUENCY     RFM12_CLOCK_OUT_FREQUENCY_1_00_MHz

/* use a callback function that is called directly from the
 * interrupt routine whenever there is a data packet available. When
 * this value is set to 1, you must use the function
 * "rfm12_set_callback(your_function)" to point to your
 * callback function in order to receive packets.
 */
#define RFM12_USE_RX_CALLBACK 0

/************************
 * RFM12BP support (high power version of RFM12)
 */

//To use RFM12BP, which needs control signals for RX enable and TX enable,
//use these defines (set to your pinout of course).
//The TX-Part can also be used to control a TX-LED with the nomral RFM12
/*
 #define RX_INIT_HOOK  DDRD |= _BV(PD5)
 #define RX_LEAVE_HOOK PORTD &= ~_BV(PD5)
 #define RX_ENTER_HOOK PORTD |= _BV(PD5)

 #define TX_INIT_HOOK  DDRD |= _BV(PD4)
 #define TX_LEAVE_HOOK PORTD &= ~_BV(PD4)
 #define TX_ENTER_HOOK PORTD |= _BV(PD4)
 */

/************************
 * UART DEBUGGING
 * en- or disable debugging via uart.
 */

#define RFM12_UART_DEBUG 0

#endif // ENABLE_GPL_RFM12B
//--
#ifdef ENABLE_MIRF24
//Define the pin on change interrupt which you connect to nIRQ of NRF24 module.
// - it can be between 0 and 23 on 28pin devices,
// - and       between 0 and 31 on 40pin devices (look at your device's pinout).
//#define mirf_PCINT 0
// define CE pin (selecting RX/TX mode) - any digital pin on microcontroller
#define mirf_CE_DDR  DDRC
#define mirf_CE_PORT PORTC
#define mirf_CE_PIN  PC6
// define CSN (SPI chip select for NRF24 module) - any digital pin on microcontroller
#define mirf_CSN_DDR  DDRC
#define mirf_CSN_PORT PORTC
#define mirf_CSN_PIN  PC7

#define mirf_CHANNEL 2
#define mirf_PAYLOAD 16

#define mirf_ADDR_LEN	5
#define mirf_CONFIG ((1<<RF24_EN_CRC) | (0<<RF24_CRCO) )

#endif // ENABLE_MIRF24

// ============ END USER ZONE --- NO EDITING ALLOWED!       ====================
// = ************************************************************************* =
// ============ DON'T MAKE MODIFICATIONS BELLOW THIS BORDER ====================

#define FALSE  0
#define TRUE   1
#define HIGH   1
#define LOW    0
#define OFF    0
#define ON     1
#define OUTPUT 1
#define INPUT  0

// stolen from and-tech.pl in attempt to use some of their functions
#define cbi(PORT, BIT) (_SFR_BYTE(PORT) &= ~_BV(BIT))// clear bit
#define sbi(PORT, BIT) (_SFR_BYTE(PORT) |= _BV(BIT)) // set bit
#define tbi(PORT, BIT) (_SFR_BYTE(PORT) ^= _BV(BIT)) // toggle bit
#define DDR(x) (_SFR_IO8(_SFR_IO_ADDR(x)-1))
#define PIN(x) (_SFR_IO8(_SFR_IO_ADDR(x)-2))
//-

// For the following macros, see Joe's Pardue documentation at
// http://code.google.com/p/avrtoolbox/
#define bit(x)	(1 << (x))
#define bit_get(p,m) ((p) & bit(m))
#define bit_set(p,m) ((p) |= bit(m))
#define bit_clear(p,m) ((p) &= ~bit(m))
#define bit_flip(p,m) ((p) ^= bit(m)) // toggle bit (see tbi)
#define bit_write(c,p,m) (c ? bit_set(p,m) : bit_clear(p,m))
#define bit_isset(p, bit) bit_get(p, bit)
#define bit_isclear(p, bit) (!bit_get(p, bit))
#define bit_rotate_right(a) a = ((a & 0x01)? ((a >> 1)| (1ULL << ((sizeof(a) * 8) - 1))) : (a >> 1))
#define bit_rotate_left(a) a = ( (a &  (  1ULL << ((sizeof(a) * 8) -1)))   ? ((a << 1) | 1) : (a << 1))
#define bit_to_shift8(mask) (((mask) & 0x01) ? 0 : (((mask) & 0x02) ? 1 : (((mask) & 0x04) ? 2 : (((mask) & 0x08) ? 3 : (((mask) & 0x10) ? 4 : (((mask) & 0x20) ? 5 : (((mask) & 0x40) ? 6 : 7 )))))))
#define bit_get_mask_field8(byte, mask) (((byte) & (mask))>>bit_to_shift8(mask))
//#define bit_to_shift8(mask) (((mask) & 0x01) ? 0 : (((mask) & 0x02) ? 1 : (((mask) & 0x04) ? 2 : (((mask) & 0x08) ? 3 : (((mask) & 0x10) ? 4 : (((mask) & 0x20) ? 5 : (((mask) & 0x40) ? 6 : (((mask) & 0x80) ? 7 : 8 ))))))))
//#define bit_get_mask_field8(byte, mask) (((byte) & (mask))>>bit_to_shift8(mask))
#define bit_hi_byte(x)	((uint8_t)(((uint16_t)(x)) >> 8))
#define bit_lo_byte(x)	((uint8_t)((uint16_t)(x)))
#define bit_byte_to_word(high, low) ((uint16_t)(((uint16_t)high << 8) | low))

// this is a permanent option but it can be made conditional
void onboard_led_enable(void);
void onboard_led_on(void);
void onboard_led_off(void);
void onboard_led_toggle(void);
//--
#ifdef ENABLE_MILLIS
#ifdef ENABLE_NB_DELAYS
#error "Non blocking delays conflicts with millis"
#endif
void millis_init(void);
uint32_t millis(void);
#endif
//--
#ifdef ENABLE_NB_DELAYS
#ifdef ENABLE_MILLIS
#error "Millis conflicts with non blocking delays"
#endif
void timer0_isr_init(void);
uint8_t check_delay(uint8_t slot);
void set_delay(uint8_t slot, uint16_t ms_time);
#endif

#ifdef ENABLE_I2C_SOFTWARE
#define I2C_PORT_O	I2C_PORT
#define I2C_PORT_D	DDR(I2C_PORT)
#define I2C_PORT_I	PIN(I2C_PORT)

#define I2C_SDA_WR()	sbi(I2C_PORT_D,I2C_SDA)
#define I2C_SDA_RD()	cbi(I2C_PORT_D,I2C_SDA)
#define I2C_SCL_WR()	sbi(I2C_PORT_D,I2C_SCL)
#define I2C_SCL_RD()	cbi(I2C_PORT_D,I2C_SCL)

#define I2C_SDA_H()	sbi(I2C_PORT_O,I2C_SDA)
#define I2C_SDA_L()	cbi(I2C_PORT_O,I2C_SDA)
#define I2C_SCL_H()	sbi(I2C_PORT_O,I2C_SCL)
#define I2C_SCL_L()	cbi(I2C_PORT_O,I2C_SCL)

uint8_t I2C_write(uint8_t b);
uint8_t I2C_read(uint8_t ack);
void I2C_start(void);
void I2C_stop(void);
#endif // end I2C software
#ifdef ENABLE_TWI

void TWI_init(void);
uint8_t TWI_start(void);
uint8_t TWI_repeatStart(void);
uint8_t TWI_sendAddress(uint8_t);
uint8_t TWI_sendData(uint8_t);
uint8_t TWI_receiveData_ACK(void);
uint8_t TWI_receiveData_NACK(void);
void TWI_stop(void);

#endif // ENABLE_TWI
#ifdef ENABLE_SPI //In preparation of porting ArduinoISP sketch
#ifdef ENABLE_SPI_INT
volatile uint8_t SPI_TC;
#endif

//SETTING "pinout" depending on microcontroller
#if defined(__AVR_ATmega16__)    || \
	defined(__AVR_ATmega16A__)     || \
    defined(__AVR_ATmega164P__)    || \
    defined(__AVR_ATmega32__)      || \
    defined(__AVR_ATmega32A__)     || \
    defined(__AVR_ATmega324P__)    || \
    defined(__AVR_ATmega324PA__)   || \
    defined(__AVR_ATmega644__)     || \
    defined(__AVR_ATmega644P__)    || \
    defined(__AVR_ATmega1284P__)

#define SCK      PB7
#define SCK_PORT PORTB
#define SCK_DDR  DDRB

#define MOSI      PB5
#define MOSI_PORT PORTB
#define MOSI_DDR  DDRB

#define MISO      PB6
#define MISO_PORT PORTB
#define MISO_PIN  PINB
#define MISO_DDR  DDRB
// no to set MISO_DDR on hardware SPI, as is set automatically as input

