funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
#define SS      PB4
#define SS_PORT PORTB
#define SS_DDR  DDRB

#elif defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560P__) // Arduino Mega1280
#define SCK      PB1
#define SCK_PORT PORTB
#define SCK_DDR  DDRB

#define MOSI      PB2
#define MOSI_PORT PORTB
#define MOSI_DDR  DDRB

#define MISO      PB3
#define MISO_PORT PORTB
#define MISO_PIN  PINB
#define MISO_DDR  DDRB
// no need to set MISO_DDR on hardware SPI, as is set automatically as input

#define SS      PB0
#define SS_PORT PORTB
#define SS_DDR  DDRB

#elif defined(__AVR_ATmega48__)    || \
      defined(__AVR_ATmega88__)      || \
      defined(__AVR_ATmega88P__)     || \
      defined(__AVR_ATmega168__)     || \
      defined(__AVR_ATmega168P__)    || \
      defined(__AVR_ATmega328P__)    // Arduino 28 pins
#define SCK      PB5
#define SCK_PORT PORTB
#define SCK_DDR  DDRB

#define MOSI      PB3
#define MOSI_PORT PORTB
#define MOSI_DDR  DDRB

#define MISO      PB4
#define MISO_PORT PORTB
#define MISO_PIN  PINB
#define MISO_DDR  DDRB
// no need to set MISO_DDR on hardware SPI, as is set automatically as input

#define SS      PB2
#define SS_PORT PORTB
#define SS_DDR  DDRB

#endif // pinout SETTINGS
#define LSBFIRST 0
#define MSBFIRST 1

#define SPI_CLOCK_DIV4 0x00
#define SPI_CLOCK_DIV16 0x01
#define SPI_CLOCK_DIV64 0x02
#define SPI_CLOCK_DIV128 0x03
#define SPI_CLOCK_DIV2 0x04
#define SPI_CLOCK_DIV8 0x05
#define SPI_CLOCK_DIV32 0x06
#define SPI_CLOCK_2DIV64 0x07

#define SPI_MODE0 0x00
#define SPI_MODE1 0x04
#define SPI_MODE2 0x08
#define SPI_MODE3 0x0C

#define SPI_MODE_MASK 0x0C  // CPOL = bit 3, CPHA = bit 2 on SPCR
#define SPI_CLOCK_MASK 0x03  // SPR1 = bit 1, SPR0 = bit 0 on SPCR
#define SPI_2XCLOCK_MASK 0x01  // SPI2X = bit 0 on SPSR
void SPI_master_setBitOrder(uint8_t bitOrder);
void SPI_master_setDataMode(uint8_t mode);
void SPI_master_setClockDivider(uint8_t rate);
void SPI_master_stop(void);

// Dharmani settings
// Master mode, MSB first, SCK phase low, SCK idle low, Low speed (fosc/64)
// SPCR register:
// | SPIE | SPE | DORD | MSTR | CPOL | CPHA | SPR1 | SPR0 |
// |  0   |  1  |  0   |  1   |  0   |  0   |  1   |  0   | = 0x52
#define SPI_LOW_SPEED        SPCR = 0x52; SPSR = 0
// Master mode, MSB first, SCK phase low, SCK idle low, Max 2 x speed (fosc/2)
// SPCR register:
// | SPIE | SPE | DORD | MSTR | CPOL | CPHA | SPR1 | SPR0 |
// |  0   |  1  |  0   |  1   |  0   |  0   |  0   |  0   | = 0x50
#define SPI_HIGH_SPEED       SPCR = 0x50; SPSR |= (1<<SPI2X)

void SPI_master_init(void);
uint8_t SPI_master_transmit(uint8_t);
uint8_t SPI_master_receive(void);
uint8_t SPI_master_transaction(uint8_t a, uint8_t b, uint8_t c, uint8_t d);

#endif // ENABLE_SPI
//--
#ifdef ENABLE_SD_CARD
//SD commands, many of these are not used ...
#define GO_IDLE_STATE            0
#define SEND_OP_COND             1
#define SEND_IF_COND             8
#define SEND_CSD                 9
#define STOP_TRANSMISSION        12
#define SEND_STATUS              13
#define SET_BLOCK_LEN            16
#define READ_SINGLE_BLOCK        17
#define READ_MULTIPLE_BLOCKS     18
#define WRITE_SINGLE_BLOCK       24
#define WRITE_MULTIPLE_BLOCKS    25
#define ERASE_BLOCK_START_ADDR   32
#define ERASE_BLOCK_END_ADDR     33
#define ERASE_SELECTED_BLOCKS    38
#define SD_SEND_OP_COND          41   //ACMD
#define APP_CMD                  55
#define READ_OCR                 58
#define CRC_ON_OFF               59

#define ON     1
#define OFF    0

volatile uint32_t SD_startBlock, SD_totalBlocks;
volatile uint8_t SDHC_flag, SD_cardType, SD_buffer[512];

// select/deselect the sd-card - sorry, is Dharmani's naming choice...
// the direction(input/output) of this pin will be set inside SD_init() function.
#define SD_CS_ASSERT     cbi(SD_CS_PORT, SD_CS_PIN)
#define SD_CS_DEASSERT   sbi(SD_CS_PORT, SD_CS_PIN)

uint8_t SD_init(void);
uint8_t SD_card_type(void);
uint8_t SD_sendCommand(uint8_t cmd, uint32_t arg);
uint8_t SD_readSingleBlock(uint32_t SD_startBlock);
uint8_t SD_writeSingleBlock(uint32_t SD_startBlock);
uint8_t SD_erase(uint32_t SD_startBlock, uint32_t SD_totalBlocks);
#endif // ENABLE_SD_CARD
#ifdef ENABLE_FAT32

//Structure to access Master Boot Record for getting info about partitions
struct MBRinfo_Structure {
	uint8_t nothing[446]; //ignore, placed here to fill the gap in the structure
	uint8_t partitionData[64];//partition records (16x4)
	uint16_t signature;//0xaa55
};

//Structure to access info of the first partition of the disk
struct partitionInfo_Structure {
	uint8_t status; //0x80 - active partition
	uint8_t headStart;//starting head
	uint16_t cylSectStart;//starting cylinder and sector
	uint8_t type;//partition type
	uint8_t headEnd;//ending head of the partition
	uint16_t cylSectEnd;//ending cylinder and sector
	uint32_t firstSector;//total sectors between MBR & the first sector of the partition
	uint32_t sectorsTotal;//size of this partition in sectors
};

//Structure to access boot sector data
struct BS_Structure {
	uint8_t jumpBoot[3]; //default: 0x009000EB
	uint8_t OEMName[8];
	uint16_t bytesPerSector;//default: 512
	uint8_t sectorPerCluster;
	uint16_t reservedSectorCount;
	uint8_t numberofFATs;
	uint16_t rootEntryCount;
	uint16_t totalSectors_F16;//must be 0 for FAT32
	uint8_t mediaType;
	uint16_t FATsize_F16;//must be 0 for FAT32
	uint16_t sectorsPerTrack;
	uint16_t numberofHeads;
	uint32_t hiddenSectors;
	uint32_t totalSectors_F32;
	uint32_t FATsize_F32;//count of sectors occupied by one FAT
	uint16_t extFlags;
	uint16_t FSversion;//0x0000 (defines version 0.0)
	uint32_t rootCluster;//first cluster of root directory (=2)
	uint16_t FSinfo;//sector number of FSinfo structure (=1)
	uint16_t BackupBootSector;
	uint8_t reserved[12];
	uint8_t driveNumber;
	uint8_t reserved1;
	uint8_t bootSignature;
	uint32_t volumeID;
	uint8_t volumeLabel[11];//"NO NAME "
	uint8_t fileSystemType[8];//"FAT32"
	uint8_t bootData[420];
	uint16_t bootEndSignature;//0xaa55
};

//Structure to access FSinfo sector data
struct FSInfo_Structure {
	uint32_t leadSignature; //0x41615252
	uint8_t reserved1[480];
	uint32_t structureSignature;//0x61417272
	uint32_t freeClusterCount;//initial: 0xffffffff
	uint32_t nextFreeCluster;//initial: 0xffffffff
	uint8_t reserved2[12];
	uint32_t trailSignature;//0xaa550000
};

//Structure to access Directory Entry in the FAT
struct dir_Structure {
	uint8_t name[11];
	uint8_t attrib; //file attributes
	uint8_t NTreserved;//always 0
	uint8_t timeTenth;//tenths of seconds, set to 0 here
	uint16_t createTime;//time file was created
	uint16_t createDate;//date file was created
	uint16_t lastAccessDate;
	uint16_t firstClusterHI;//higher word of the first cluster number
	uint16_t writeTime;//time of last write
	uint16_t writeDate;//date of last write
	uint16_t firstClusterLO;//lower word of the first cluster number
	uint32_t fileSize;//size of file in bytes
};

//Attribute definitions for file/directory
#define ATTR_READ_ONLY     0x01
#define ATTR_HIDDEN        0x02
#define ATTR_SYSTEM        0x04
#define ATTR_VOLUME_ID     0x08
#define ATTR_DIRECTORY     0x10
#define ATTR_ARCHIVE       0x20
#define ATTR_LONG_NAME     0x0f

#define DIR_ENTRY_SIZE     0x32
#define EMPTY              0x00
#define DELETED            0xe5
#define GET                   0
#define SET                   1
#define READ                  0
#define VERIFY                1
#define ADD                   0
#define REMOVE                1
#define LOW                   0
#define HIGH                  1
#define TOTAL_FREE            1
#define NEXT_FREE             2
#define GET_LIST              0
#define GET_FILE              1
#define DELETE                2
#define FAT32_EOF    0x0fffffff

//************* external variables *************
volatile uint32_t firstDataSector, rootCluster, totalClusters;
volatile uint16_t bytesPerSector, sectorPerCluster, reservedSectorCount;
uint32_t unusedSectors, appendFileSector, appendFileLocation, fileSize,
appendStartCluster;

//global flag to keep track of free cluster count updating in FSinfo sector
uint8_t freeClusterCountUpdated;

//data string where data is collected before sending to the card
volatile uint8_t dataString[MAX_STRING_SIZE];
uint16_t timeFAT, dateFAT;

//************* functions *************
uint8_t getDateTime_FAT(void);
uint8_t F32_getBootSectorData(void);
uint32_t F32_getFirstSector(uint32_t clusterNumber);
uint32_t F32_getSetFreeCluster(uint8_t totOrNext, uint8_t get_set,
		uint32_t FSEntry);
struct dir_Structure* F32_findFiles(uint8_t flag, uint8_t *fileName);
uint32_t F32_getSetNextCluster(uint32_t clusterNumber, uint8_t get_set,
		uint32_t clusterEntry);
uint8_t F32_readFile(uint8_t flag, uint8_t *fileName);
//uint8_t F32_convertFileName(uint8_t *fileName);
uint8_t F32_writeFile(uint8_t *fileName, uint8_t *dataString);
void F32_appendFile(void);
uint32_t F32_searchNextFreeCluster(uint32_t startCluster);
void F32_displayMemory(uint8_t flag, uint32_t memory);
void F32_deleteFile(uint8_t *fileName);
void F32_freeMemoryUpdate(uint8_t flag, uint32_t size);
#endif //ENABLE_FAT32
//--
#ifdef ENABLE_RFM12B
/* DOCUMENTATION
 *
 * 	- Hardware connections:

 RFM12B		|	ATMEGA328P	|	Other Hardware		|	ATMEGA1284P
 ------------------------------------------------------------------
 GND		|	   GND		|						|	GND
 VDD		|	   3.3V		|						|	3.3V

 FSK		|	   NC		|						|	NC
 CLK		|	   NC		|						|	NC
 DCLK	|	   NC		|						|	NC
 NIRQ	|	   NC		|						|	NC
 NRES	|	   NC		|						|	NC

 NSEL	|	   PB2		|						|	PB4
 SCK		|	   PB5		|						|	PB7
 SDI		|	   PB3		|						|	PB5
 SDO		|	   PB4		|						|	PB6

