funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
 |	   PB1		| 	RED LED circuit		|	PC4
 |	   PB0		| 	GREEN LED circuit	|	PC6
 *
 */

// use the following whenever read or send from/to RFM12B module,
// and especially when you have other modules connected to SPI and need
// different transmission speed (e.g., SD-Card)
#define RF_SPI_LOW_SPEED SPCR = 0x50; SPSR = 0

unsigned char volatile DATA_RDY2SND = 0; // flag for indicating when to transmit data
unsigned char volatile rf_buff[256], rf_rxbuff[256];//provide some buffer for data

int volatile rf_buffindex = 0;// index for keeping place in buffer
unsigned char volatile rf_rxbuffindex = 0;// index for keeping place in buffer

/*inline void timeout_init(void);
 inline uint8_t timeout(void);
 uint8_t rf12_is_ready(void);
 uint16_t rf12_trans(uint16_t to_send);
 void rf12_txbyte(uint8_t b);
 uint8_t rf12_rxbyte(void);*/
void radio_config(void);
void radio_send(uint8_t volatile * buffer, uint8_t len);
int16_t radio_rcv(uint8_t volatile * buffer, uint8_t max_len);

#endif
//--
#ifdef ENABLE_GPL_RFM12B
/************************
 * VARIOUS RFM RELATED DEFINES FOR INTERNAL USE
 *(defines which shall be visible to the user are located in rfm12.h)
 */

//default preamble (altrernating 1s and 0s)
#define PREAMBLE 0xAA

//default synchronization pattern
#define SYNC_MSB 0x2D
#define SYNC_LSB 0xD4

//these are the states for the receive/transmit state machine
#define STATE_RX_IDLE 0
#define STATE_RX_ACTIVE 1
#define STATE_TX 2
#define STATE_POWER_DOWN 3

//packet header length in bytes
#define PACKET_OVERHEAD 3

/************************
 * LIBRARY DEFAULT SETTINGS
 */

#ifdef PWRMGT_DEFAULT
#warning "You are using the PWRMGT_DEFAULT makro directly in your rfm12_config.h - this is no longer supported."
#warning "RFM12_USE_WAKEUP_TIMER and RFM12_LOW_BATT_DETECTOR care about this on their own now. just remove PWRMGT_DEFAULT if you needed it for that."
#warning "if you need the clock output, use the new RFM12_USE_CLOCK_OUTPUT instead!"
#undef PWRMGT_DEFAULT
#endif

//if notreturns is not defined, we won't use this feature
#ifndef RFM12_NORETURNS
#define RFM12_NORETURNS 0
#endif

//if transmit only is not defined, we won't use this feature
#ifndef RFM12_TRANSMIT_ONLY
#define RFM12_TRANSMIT_ONLY 0
#endif

//if transmit only is on, we need to turn of collision detection
#if RFM12_TRANSMIT_ONLY
//disable collision detection, as we won't be able to receive data
#ifdef RFM12_NOCOLLISIONDETECTION
#undef RFM12_NOCOLLISIONDETECTION
#endif
#define RFM12_NOCOLLISIONDETECTION 1
#endif

//if nocollisiondetection is not defined, we won't use this feature
#ifndef RFM12_NOCOLLISIONDETECTION
#define RFM12_NOCOLLISIONDETECTION 0
#endif

//if livectrl is not defined, we won't use this feature
#ifndef RFM12_LIVECTRL
#define RFM12_LIVECTRL 0
#endif

//if low battery detector is not defined, we won't use this feature
#ifndef RFM12_LOW_BATT_DETECTOR
#define RFM12_LOW_BATT_DETECTOR 0
#endif

#ifndef RFM12_USE_CLOCK_OUTPUT
#define RFM12_USE_CLOCK_OUTPUT 0
#endif

#if RFM12_USE_CLOCK_OUTPUT
//Enable Xtal oscillator
#define PWRMGMT_CLCKOUT (RFM12_PWRMGT_EX)
#else
//Disable Clock output
#define PWRMGMT_CLCKOUT (RFM12_PWRMGT_DC)
#endif

//if the low battery detector feature is used, we will set some extra pwrmgmt options
#if RFM12_LOW_BATT_DETECTOR
//define PWRMGMT_LOW_BATT  with low batt detector
//it will be used later
#define PWRMGMT_LOW_BATT (RFM12_PWRMGT_EB)

//check if the default power management setting has the LB bit set
//and warn the user if it's not
#ifdef PWRMGT_DEFAULT
#if !((PWRMGT_DEFAULT) & RFM12_PWRMGT_EB)
#warning "You are using the RFM12 low battery detector, but PWRMGT_DEFAULT has the low battery detector bit unset."
#endif
#endif
#else
#define PWRMGMT_LOW_BATT 0
#endif /* RFM12_LOW_BATT_DETECTOR */

//if wakeuptimer is not defined, we won't use this feature
#ifndef RFM12_USE_WAKEUP_TIMER
#define RFM12_USE_WAKEUP_TIMER 0
#endif

//if wakeuptimer is on, we will set the default power management to use the wakeup timer
#if RFM12_USE_WAKEUP_TIMER
//define PWRMGMT_LOW_BATT  with low batt detector
//it will be used later
#define PWRMGMT_WKUP (RFM12_PWRMGT_EW)

//check if the default power management setting has the EW bit set
//and warn the user if it's not
#ifdef PWRMGT_DEFAULT
#if !((PWRMGT_DEFAULT) & RFM12_PWRMGT_EW)
#warning "You are using the RFM12 wakeup timer, but PWRMGT_DEFAULT has the wakeup timer bit unset."
#endif
#endif

//enable powermanagement shadowing
#define RFM12_PWRMGT_SHADOW 1
#else
#define PWRMGMT_WKUP 0
#endif /* RFM12_USE_WAKEUP_TIMER */

//if ASK tx is not defined, we won't use this feature
#ifndef RFM12_TRANSMIT_ASK
#define RFM12_TRANSMIT_ASK 0
#endif

//if receive ASK is not defined, we won't use this feature
#ifndef RFM12_RECEIVE_ASK
#define RFM12_RECEIVE_ASK 0
#endif

//if software spi is not defined, we won't use this feature
#ifndef RFM12_SPI_SOFTWARE
#define RFM12_SPI_SOFTWARE 0
#endif

//if uart debug is not defined, we won't use this feature
#ifndef RFM12_UART_DEBUG
#define RFM12_UART_DEBUG 0
#endif

#ifndef RFM12_PWRMGT_SHADOW
#define RFM12_PWRMGT_SHADOW 0
#endif

//default value for powermanagement register
#ifndef PWRMGT_DEFAULT
#define PWRMGT_DEFAULT (PWRMGMT_CLCKOUT | PWRMGMT_WKUP | PWRMGMT_LOW_BATT)
#endif

//define a default receive power management mode
#if RFM12_TRANSMIT_ONLY
//the receiver is turned off by default in transmit only mode
#define PWRMGT_RECEIVE (RFM12_CMD_PWRMGT | PWRMGT_DEFAULT)
#else
//the receiver is turned on by default in normal mode
#define PWRMGT_RECEIVE (RFM12_CMD_PWRMGT | PWRMGT_DEFAULT | RFM12_PWRMGT_ER)
#endif

//default channel free time, if not defined elsewhere
#ifndef CHANNEL_FREE_TIME
#define CHANNEL_FREE_TIME 200
#endif

/*
 * backward compatibility for the spi stuff
 * these values weren't set in older revisions of this library
 * so they're now assumed to be on the same pin/port.
 * otherwise these defines serve to configure the software SPI ports
 */
/*
 #ifndef DDR_MOSI
 #define DDR_MOSI DDR_SPI
 #define PORT_MOSI PORT_SPI
 #endif

 #ifndef DDR_MISO
 #define DDR_MISO DDR_SPI
 #define PIN_MISO PIN_SPI
 #endif

 #ifndef DDR_SCK
 #define DDR_SCK DDR_SPI
 #define PORT_SCK PORT_SPI
 #endif

