funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
 #ifndef DDR_SPI_SS
 #define DDR_SPI_SS DDR_SPI
 #define PORT_SPI_SS PORT_SPI
 #endif
 */

/*
 * backward compatibility for rf channel settings
 * these values weren't set in the config in older revisions of this library
 * so we assume defaults here.
 */

#ifndef RFM12_XTAL_LOAD
#define                        RFM12_XTAL_LOAD RFM12_XTAL_11_5PF
#endif

#ifndef RFM12_POWER
#define RFM12_POWER            RFM12_TXCONF_POWER_0
#endif

#ifndef FSK_SHIFT
#define FSK_SHIFT 125000
#endif

#ifndef RFM12_RSSI_THRESHOLD
#define RFM12_RSSI_THRESHOLD   RFM12_RXCTRL_RSSI_79
#endif

#ifndef RFM12_FILTER_BW
#define RFM12_FILTER_BW        RFM12_RXCTRL_BW_400
#endif

#ifndef RFM12_LNA_GAIN
#define RFM12_LNA_GAIN         RFM12_RXCTRL_LNA_6
#endif

#ifndef RFM12_LBD_VOLTAGE
#define RFM12_LBD_VOLTAGE      RFM12_LBD_VOLTAGE_3V7
#endif

#ifndef RFM12_CLOCK_OUT_FREQUENCY
#define RFM12_CLOCK_OUT_FREQUENCY RFM12_CLOCK_OUT_FREQUENCY_1_00_MHz
#endif

#ifndef RFM12_FREQUENCY
#ifndef FREQ
#error "RFM12_FREQUENCY not defined."
#else
#define RFM12_FREQUENCY FREQ
#warning "using FREQ for RFM12_FREQUENCY. Please use RFM12_FREQUENCY in the future!"
#endif
#endif

//baseband selection
#if (RFM12_BASEBAND) == RFM12_BAND_433
#define RFM12_FREQUENCY_CALC(x) RFM12_FREQUENCY_CALC_433(x)
#elif (RFM12_BASEBAND) == RFM12_BAND_868
#define RFM12_FREQUENCY_CALC(x) RFM12_FREQUENCY_CALC_868(x)
#elif (RFM12_BASEBAND) == RFM12_BAND_915
#define RFM12_FREQUENCY_CALC(x) RFM12_FREQUENCY_CALC_915(x)
#else
#error "Unsupported RFM12 baseband selected."
#endif

/************************
 * HELPER MACROS
 */

//macros to turn the int on and off
//if polling is used, just define these macros as empty
#if !(RFM12_USE_POLLING)
#define RFM12_INT_ON() RFM12_INT_MSK |= (1<<RFM12_INT_BIT)
#define RFM12_INT_OFF() RFM12_INT_MSK &= ~(1<<RFM12_INT_BIT)
#else
#define RFM12_INT_ON()
#define RFM12_INT_OFF()
#endif /* !(RFM12_USE_POLLING) */

/*
 * the following macros help to manage the rfm12 fifo
 * default fiforeset is as follows:
 * 2 Byte Sync Pattern, disable sensitive reset, fifo filled interrupt at 8 bits
 */
//default fiforeset register value to accept data
#define ACCEPT_DATA (RFM12_CMD_FIFORESET | RFM12_FIFORESET_DR | (8<<4) | RFM12_FIFORESET_FF)
#define ACCEPT_DATA_INLINE (RFM12_FIFORESET_DR | (8<<4) | RFM12_FIFORESET_FF)
//default fiforeset register value to clear fifo
#define CLEAR_FIFO (RFM12_CMD_FIFORESET | RFM12_FIFORESET_DR | (8<<4))
#define CLEAR_FIFO_INLINE (RFM12_FIFORESET_DR | (8<<4))

//this macro helps to encapsulate the return values, when noreturn is set to on
#if (RFM12_NORETURNS)
#define TXRETURN(a)
#else
#define TXRETURN(a) (a)
#endif

/** \name States for rx and tx buffers
 * \anchor rxtx_states
 * \see rfm12_rx_status() and rfm12_control_t
 * @{
 */
//! Indicates that the buffer is free
#define STATUS_FREE 0
//! Indicates that the buffer is in use by the library
#define STATUS_OCCUPIED 1
//! Indicates that a receive buffer holds a complete transmission
#define STATUS_COMPLETE 2
//@}

/** \name  Return values for rfm12_tx() and rfm12_start_tx()
 * \anchor tx_retvals
 * \see rfm12_tx() and rfm12_start_tx()
 * @{
 */
//!  The packet data is longer than the internal buffer
#define RFM12_TX_ERROR 0x02
//! The transmit buffer is already occupied
#define RFM12_TX_OCCUPIED 0x03
//! The packet has been enqueued successfully
#define RFM12_TX_ENQUEUED 0x80
//@}

/************************
 * function protoypes
 */

//see rfm12.c for more documentation
void rfm12_init(void);
void rfm12_tick(void);

#if RFM12_USE_RX_CALLBACK
/* set the callback function pointer */
void rfm12_set_callback ((*in_func)(uint8_t, uint8_t *));
#endif
//if receive mode is not disabled (default)
#if !(RFM12_TRANSMIT_ONLY)
void rfm12_rx_clear(void);
#endif /* !(RFM12_TRANSMIT_ONLY) */

//FIXME: the tx function should return a status, do we need to do this also?
// uint8_t rfm12_tx_status();

#if (RFM12_NORETURNS)
//see rfm12.c for more documentation
void rfm12_start_tx(uint8_t type, uint8_t length);
#if !(RFM12_SMALLAPI)
void rfm12_tx(uint8_t len, uint8_t type, uint8_t *data);
#endif
#else
uint8_t rfm12_start_tx(uint8_t type, uint8_t length);
#if !(RFM12_SMALLAPI)
uint8_t rfm12_tx(uint8_t len, uint8_t type, uint8_t *data);
#endif
#endif

//if polling is used, define a polling function
#if RFM12_USE_POLLING
void rfm12_poll(void);
#endif

/************************
 * private control structs
 */

//! The transmission buffer structure.
/** \note Note that this complete buffer is transmitted sequentially,
 * beginning with the sync bytes.
 *
 * \see rfm12_start_tx(), rfm12_tx() and rf_tx_buffer
 */
typedef struct {
	//! Sync bytes for receiver to start filling fifo.
	uint8_t sync[2];

	//! Length byte - number of bytes in buffer.
	uint8_t len;

	//! Type field for the simple airlab protocol.
	uint8_t type;

	//! Checksum over the former two members.
	uint8_t checksum;

	//! Buffer for the raw bytes to be transmitted.
	uint8_t buffer[RFM12_TX_BUFFER_SIZE];
} rf_tx_buffer_t;

//if receive mode is not disabled (default)
#if !(RFM12_TRANSMIT_ONLY)
//! The receive buffer structure.
/** \note Note that there will be two receive buffers of this type,
 * as double buffering is being employed by this library.
 *
 * \see rfm12_rx_status(), rfm12_rx_len(), rfm12_rx_type(), rfm12_rx_buffer() , rfm12_rx_clear() and rf_rx_buffers
 */
typedef struct {
	//! Indicates if the buffer is free or completed.
	/** \see \ref rxtx_states "States for rx and tx buffers" */
	volatile uint8_t status;

	//! Length byte - number of bytes in buffer.
	uint8_t len;

	//! Type field for the simple airlab protocol.
	uint8_t type;

	//! Checksum over the type and length header fields
	uint8_t checksum;

	//! The actual receive buffer data
	uint8_t buffer[RFM12_RX_BUFFER_SIZE];
} rf_rx_buffer_t;
#endif /* !(RFM12_TRANSMIT_ONLY) */

//! Control and status structure.
/** This data structure keeps all control and some status related variables. \n
 * By using a central structure for all global variables, the compiler can
 * use smaller instructions and reduce the size of the binary.
 *
 * \note Some states are defined in the non-documented rfm12_core.h header file.
 * \see ISR(RFM12_INT_VECT, ISR_NOBLOCK), rfm12_tick() and ctrl
 */
typedef struct {
	//! This controls the library internal state machine.
	volatile uint8_t rfm12_state;

	//! Transmit buffer status.
	/** \see \ref rxtx_states "States for rx and tx buffers" */
	volatile uint8_t txstate;

	//! Number of bytes to transmit or receive.
	/** This refers to the overall data size, including header data and sync bytes. */
	uint8_t num_bytes;

	//! Counter for the bytes we are transmitting or receiving at the moment.
	uint8_t bytecount;

