funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
/*
 11. TX Configuration Control Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 0 0 1 1 0 0 mp m3 m2 m1 m0 0 p2 p1 p0 9800h

 Bits 8-4 (mp, m3 to m0): FSK modulation parameters:
 The resulting output frequency can be calculated as:
 fout = f0 + (-1)SIGN * (M + 1) * (15 kHz)
 where:
 f0 is the channel center frequency (see the
 Frequency Setting Command)
 M is the four bit binary number <m3 : m0>
 SIGN = (mp) XOR FSK

 Bits 2-0 (p2 to p0): Output power:
 p2 p1 p0 Relative Output Power [dB]
 0 0 0 0
 0 0 1 -2.5
 0 1 0 -5
 0 1 1 -7.5
 1 0 0 -10
 1 0 1 -12.5
 1 1 0 -15
 1 1 1 -17.5

 */

#define RFM12_CMD_TXCONF 0x9800
#define RFM12_TXCONF_MP 0x100
#define RFM12_TXCONF_POWER_0 	0x00
#define RFM12_TXCONF_POWER_3 	0x01
#define RFM12_TXCONF_POWER_6 	0x02
#define RFM12_TXCONF_POWER_9 	0x03
#define RFM12_TXCONF_POWER_12 	0x04
#define RFM12_TXCONF_POWER_15   0x05
#define RFM12_TXCONF_POWER_18 	0x06
#define RFM12_TXCONF_POWER_21   0x07
#define RFM12_TXCONF_FSK_MASK   0xf0
#define RFM12_TXCONF_FS_CALC(f) (((f/15000UL)-1)<<4)
#define RFM12_TXCONF_MASK 0x01F7
#define RFM12_TXCONF_POWER_MASK 0x07

/*
 12. PLL Setting Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 1 1 0 0 0 ob1 ob0 0 ddy ddit 1 bw0 CC67h
 Note: POR default setting of the register carefully selected to cover almost all typical applications.
 Bit 6-5 (ob1-ob0): Microcontroller output clock buffer rise and fall time control.
 ob1 ob0 Selected uC CLK frequency
 0 0 5 or 10 MHz (recommended)
 0 1 3.3 MHz
 1 X 2.5 MHz or less

 (Typ conditions: Top = 27 oC; Vdd = Voc = 2.7 V, Crystal ESR = 30 Ohm)

 Bit 3 (ddy): Switches on the delay in the phase detector when this bit is set.
 Bit 2 (ddit): When set, disables the dithering in the PLL loop.
 Bit 0 (bw0): PLL bandwidth can be set for optimal TX RF performance.

 bw0		Max bit rate [kbps]		Phase noise at 1MHz offset [dBc/Hz]
 0		86.2					-107
 1		256						-102

 Note: Needed for optimization of the RF
 performance. Optimal settings can vary
 according to the external load capacitance.
 */

#define RFM12_CMD_PLL	0xCC02
#define RFM12_PLL_DDY	0x08
#define RFM12_PLL_DDIT	0x04
#define RFM12_PLL_BW0	0x01

/*
 13. Transmitter Register Write Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 0 1 1 1 0 0 0 t7 t6 t5 t4 t3 t2 t1 t0 B8AAh
 With this command, the controller can write 8 bits (t7 to t0) to the transmitter data register. Bit 7 (el) must be set in Configuration
 Setting Command.
 */

#define RFM12_CMD_TX 0xB800

/*
 14. Wake-Up Timer Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 1 r4 r3 r2 r1 r0 m7 m6 m5 m4 m3 m2 m1 m0 E196h
 The wake-up time period can be calculated by (m7 to m0) and (r4 to r0):
 Twake-up = 1.03 * M * 2R + 0.5 [ms]
 Note:
 • For continual operation the ew bit should be cleared and set at the end of every cycle.
 • For future compatibility, use R in a range of 0 and 29.
 */
#define RFM12_CMD_WAKEUP 0xE000

/*
 15. Low Duty-Cycle Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 1 0 0 0 d6 d5 d4 d3 d2 d1 d0 en C80Eh
 With this command, Low Duty-Cycle operation can be set in order to decrease the average power consumption in receiver mode.
 The time cycle is determined by the Wake-Up Timer Command.
 The Duty-Cycle can be calculated by using (d6 to d0) and M. (M is parameter in a Wake-Up Timer Command.)
 Duty-Cycle= (D * 2 +1) / M *100%
 The on-cycle is automatically extended while DQD indicates good received signal condition (FSK transmission is detected in the
 frequency range determined by Frequency Setting Command plus and minus the baseband filter bandwidth determined by the
 Receiver Control Command).
 */
#define RFM12_CMD_DUTYCYCLE 0xC800
#define RFM12_DUTYCYCLE_ENABLE 0x01

/*
 16. Low Battery Detector and Microcontroller Clock Divider Command
 Bit 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 POR
 1 1 0 0 0 0 0 0 d2 d1 d0 0 v3 v2 v1 v0 C000h
 The 4 bit parameter (v3 to v0) represents the value V, which defines the threshold voltage Vlb of the detector:
 Vlb= 2.25 + V * 0.1 [V]
 Clock divider configuration:
 Clock Output
 Frequency [MHz]
 0 0 0 1
 0 0 1 1.25
 0 1 0 1.66
 0 1 1 2
 1 0 0 2.5
 1 0 1 3.33
 1 1 0 5
 1 1 1 10
 d2 d1 d0
 The low battery detector and the clock output can be enabled or disabled by bits eb and dc, respectively, using the Power
 Management Command.
 */
#define RFM12_CMD_LBDMCD 0xC000

#define RFM12_LBD_VOLTAGE_2V2 0
#define RFM12_LBD_VOLTAGE_2V3 1
#define RFM12_LBD_VOLTAGE_2V4 2
#define RFM12_LBD_VOLTAGE_2V5 3
#define RFM12_LBD_VOLTAGE_2V6 4
#define RFM12_LBD_VOLTAGE_2V7 5
#define RFM12_LBD_VOLTAGE_2V8 6
#define RFM12_LBD_VOLTAGE_2V9 7
#define RFM12_LBD_VOLTAGE_3V0 8
#define RFM12_LBD_VOLTAGE_3V1 9
#define RFM12_LBD_VOLTAGE_3V2 10
#define RFM12_LBD_VOLTAGE_3V3 11
#define RFM12_LBD_VOLTAGE_3V4 12
#define RFM12_LBD_VOLTAGE_3V5 13
#define RFM12_LBD_VOLTAGE_3V6 14
#define RFM12_LBD_VOLTAGE_3V7 15

#define RFM12_CLOCK_OUT_FREQUENCY_1_00_MHz  (0<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_1_25_MHz  (1<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_1_66_MHz  (2<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_2_00_MHz  (3<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_2_50_MHz  (4<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_3_33_MHz  (5<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_5_00_MHz  (6<<5)
#define RFM12_CLOCK_OUT_FREQUENCY_10_00_MHz (7<<5)

/*
 17. Status Read Command
 The read command starts with a zero, whereas all other control commands start with a one. If a read command is identified, the
 status bits will be clocked out on the SDO pin as follows:

 bitnumber
 15	RGIT TX register is ready to receive the next byte (Can be cleared by Transmitter Register Write Command)
 FFIT The number of data bits in the RX FIFO has reached the pre-programmed limit (Can be cleared by any of the
 FIFO read methods)
 14	POR Power-on reset (Cleared after Status Read Command)
 13	RGUR TX register under run, register over write (Cleared after Status Read Command)
 FFOV RX FIFO overflow (Cleared after Status Read Command)
 12	WKUP Wake-up timer overflow (Cleared after Status Read Command)
 11	EXT Logic level on interrupt pin (pin 16) changed to low (Cleared after Status Read Command)
 10	LBD Low battery detect, the power supply voltage is below the pre-programmed limit
 9	FFEM FIFO is empty
 8	ATS Antenna tuning circuit detected strong enough RF signal
 RSSI The strength of the incoming signal is above the pre-programmed limit
 7	DQD Data quality detector output
 6	CRL Clock recovery locked
 5	ATGL Toggling in each AFC cycle
 4	OFFS(6) MSB of the measured frequency offset (sign of the offset value)
 3	OFFS(3) -OFFS(0) Offset value to be added to the value of the frequency control parameter (Four LSB bits)
 2
 1
 0
 */

#define RFM12_CMD_STATUS	0x0000
#define RFM12_STATUS_RGIT	0x8000
#define RFM12_STATUS_FFIT	0x8000
#define RFM12_STATUS_POR	0x4000
#define RFM12_STATUS_RGUR	0x2000
#define RFM12_STATUS_FFOV	0x2000
#define RFM12_STATUS_WKUP	0x1000
#define RFM12_STATUS_EXT	0x0800
#define RFM12_STATUS_LBD	0x0400
#define RFM12_STATUS_FFEM	0x0200
#define RFM12_STATUS_ATS	0x0100
#define RFM12_STATUS_RSSI	0x0100
#define RFM12_STATUS_DQD	0x0080
#define RFM12_STATUS_CRL	0x0040
#define RFM12_STATUS_ATGL	0x0020

/* undocumented software reset command for the rf12
 */
#define RFM12_RESET		0xffff

#endif // ENABLE_GPL_RFM12B
//--
#ifdef ENABLE_MIRF24
#define mirf_csnHi        mirf_CSN_PORT |=  (1<<mirf_CSN_PIN);
#define mirf_csnLow       mirf_CSN_PORT &= ~(1<<mirf_CSN_PIN);
#define mirf_ceHi         mirf_CE_PORT  |=  (1<<mirf_CE_PIN);
#define mirf_ceLow        mirf_CE_PORT  &= ~(1<<mirf_CE_PIN);

uint8_t mirf_PTX;

void mirf_init();
void mirf_config();
void mirf_send(uint8_t *value);
void mirf_setRADDR(uint8_t * adr);
void mirf_setTADDR(uint8_t * adr);
uint8_t mirf_dataReady();
uint8_t mirf_isSending();
uint8_t mirf_rxFifoEmpty();
uint8_t mirf_txFifoEmpty();
void mirf_getData(uint8_t * data);
uint8_t mirf_getStatus();

