funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
void mirf_transmitSync(uint8_t *dataout,uint8_t len);
void mirf_transferSync(uint8_t *dataout,uint8_t *datain,uint8_t len);
void mirf_configRegister(uint8_t reg, uint8_t value);
void mirf_readRegister(uint8_t reg, uint8_t * value, uint8_t len);
void mirf_writeRegister(uint8_t reg, uint8_t * value, uint8_t len);
void mirf_powerUpRx();
void mirf_powerUpTx();
void mirf_powerDown();
void mirf_flushRx();

#endif // ENABLE_MIRF24
//--
#ifdef ENABLE_ONE_WIRE
#define OW_MATCH_ROM    0x55
#define OW_SKIP_ROM     0xCC
#define OW_SEARCH_ROM   0xF0

#define OW_SEARCH_FIRST 0xFF        // start new search
#define OW_PRESENCE_ERR 0xFF
#define OW_DATA_ERR     0xFE
#define OW_LAST_DEVICE  0x00        // last device found
// rom-code size including CRC
#define OW_ROMCODE_SIZE 8

uint8_t ow_reset(void);

uint8_t ow_bit_io(uint8_t b);
uint8_t ow_byte_wr(uint8_t b);
uint8_t ow_byte_rd(void);

uint8_t ow_rom_search(uint8_t diff, uint8_t *id);

void ow_command(uint8_t command, uint8_t *id);
void ow_command_with_parasite_enable(uint8_t command, uint8_t *id);

void ow_parasite_enable(void);
void ow_parasite_disable(void);
uint8_t ow_input_pin_state(void);

#ifndef OW_ONE_BUS
void ow_set_bus( volatile uint8_t* in,
		volatile uint8_t* out,
		volatile uint8_t* ddr,
		uint8_t pin );
#endif

#ifdef ENABLE_DS18_2_
uint8_t crc8(uint8_t* data, uint16_t number_of_bytes_in_data);
//

// return values
#define DS18X20_OK                0x00
#define DS18X20_ERROR             0x01
#define DS18X20_START_FAIL        0x02
#define DS18X20_ERROR_CRC         0x03

#define DS18X20_INVALID_DECICELSIUS  2000

#define DS18X20_POWER_PARASITE    0x00
#define DS18X20_POWER_EXTERN      0x01

#define DS18X20_CONVERSION_DONE   0x00
#define DS18X20_CONVERTING        0x01

// DS18X20 specific values (see datasheet)
#define DS18S20_FAMILY_CODE       0x10
#define DS18B20_FAMILY_CODE       0x28
#define DS1822_FAMILY_CODE        0x22

#define DS18X20_CONVERT_T         0x44
#define DS18X20_READ              0xBE
#define DS18X20_WRITE             0x4E
#define DS18X20_EE_WRITE          0x48
#define DS18X20_EE_RECALL         0xB8
#define DS18X20_READ_POWER_SUPPLY 0xB4

#define DS18B20_CONF_REG          4
#define DS18B20_9_BIT             0
#define DS18B20_10_BIT            (1<<5)
#define DS18B20_11_BIT            (1<<6)
#define DS18B20_12_BIT            ((1<<6)|(1<<5))
#define DS18B20_RES_MASK          ((1<<6)|(1<<5))

// undefined bits in LSB if 18B20 != 12bit
#define DS18B20_9_BIT_UNDF        ((1<<0)|(1<<1)|(1<<2))
#define DS18B20_10_BIT_UNDF       ((1<<0)|(1<<1))
#define DS18B20_11_BIT_UNDF       ((1<<0))
#define DS18B20_12_BIT_UNDF       0

// conversion times in milliseconds
#define DS18B20_TCONV_12BIT       750
#define DS18B20_TCONV_11BIT       DS18B20_TCONV_12_BIT/2
#define DS18B20_TCONV_10BIT       DS18B20_TCONV_12_BIT/4
#define DS18B20_TCONV_9BIT        DS18B20_TCONV_12_BIT/8
#define DS18S20_TCONV             DS18B20_TCONV_12_BIT

// constant to convert the fraction bits to cel*(10^-4)
#define DS18X20_FRACCONV          625

// scratchpad size in bytes
#define DS18X20_SP_SIZE           9

// DS18X20 EEPROM-Support
#define DS18X20_WRITE_SCRATCHPAD  0x4E
#define DS18X20_COPY_SCRATCHPAD   0x48
#define DS18X20_RECALL_E2         0xB8
#define DS18X20_COPYSP_DELAY      10 /* ms */
#define DS18X20_TH_REG            2
#define DS18X20_TL_REG            3

#define DS18X20_DECIMAL_CHAR      '.'

extern uint8_t DS18X20_find_sensor(uint8_t *diff, uint8_t id[]);
extern uint8_t DS18X20_get_power_status(uint8_t id[]);
extern uint8_t DS18X20_start_meas(uint8_t with_external, uint8_t id[]);
// returns 1 if conversion is in progress, 0 if finished
// not available when parasite powered
extern uint8_t DS18X20_conversion_in_progress(void);

#if DS18X20_DECICELSIUS
extern uint8_t DS18X20_read_decicelsius(uint8_t id[], int16_t *decicelsius);
extern uint8_t DS18X20_read_decicelsius_single(uint8_t familycode,
		int16_t *decicelsius);
extern uint8_t DS18X20_format_from_decicelsius(int16_t decicelsius, int8_t s[],
		uint8_t n);
#endif // DS18X20_DECICELSIUS
#if DS18X20_MAX_RESOLUTION
// temperature unit for max. resolution is °C * 10e-4
// examples: -250625 -> -25.0625°C, 1250000 -> 125.0000 °C
extern uint8_t DS18X20_read_maxres(uint8_t id[], int32_t *temperaturevalue);
extern uint8_t DS18X20_read_maxres_single(uint8_t familycode,
		int32_t *temperaturevalue);
extern uint8_t DS18X20_format_from_maxres(int32_t temperaturevalue, char s[],
		uint8_t n);
#endif // DS18X20_MAX_RESOLUTION
#if DS18X20_EEPROMSUPPORT
// write th, tl and config-register to scratchpad (config ignored on DS18S20)
uint8_t DS18X20_write_scratchpad(uint8_t id[], uint8_t th, uint8_t tl,
		uint8_t conf);
// read scratchpad into array SP
uint8_t DS18X20_read_scratchpad(uint8_t id[], uint8_t sp[], uint8_t n);
// copy values int scratchpad into DS18x20 eeprom
uint8_t DS18X20_scratchpad_to_eeprom(uint8_t with_power_extern, uint8_t id[]);
// copy values from DS18x20 eeprom into scratchpad
uint8_t DS18X20_eeprom_to_scratchpad(uint8_t id[]);
#endif // DS18X20_EEPROMSUPPORT
#if DS18X20_VERBOSE
extern void DS18X20_show_id_uart(uint8_t *id, size_t n);
extern uint8_t DS18X20_read_meas_all_verbose(void);
#endif // DS18X20_VERBOSE
#endif // ENABLE_DS18_20_
#endif // ENABLE_ONE_WIRE
//--
#ifdef ENABLE_CONVERSION // various conversion functions
uint8_t bcd2bin(uint8_t bcd);
uint8_t bin2bcd(uint8_t bin);
uint8_t nibble2hex(uint8_t val);
void byte2hex(uint8_t val, int8_t *s);
void word2hex(uint16_t val, int8_t *s);
void double2hex(uint32_t val, int8_t *s);
void byte2dec(uint8_t val, int8_t *s);
#endif // end Conversion
//--
#ifdef ENABLE_XPRINTF
#if _USE_XFUNC_OUT
#define xdev_out(func) xfunc_out = (void(*)(unsigned char))(func)
extern void (*xfunc_out)(unsigned char);
void xputc (char c);
void xputs (const char* str);
void xfputs (void (*func)(unsigned char), const char* str);
void xprintf (const char* fmt, ...);
void xprintf_P (const char* fmt, ...);
void xsprintf (char* buff, const char* fmt, ...);
void xsprintf_P (char* buff, const char* fmt, ...);
void xfprintf (void (*func)(unsigned char), const char* fmt, ...);
void put_dump (const void* buff, unsigned long addr, int len, int width);
#define DW_CHAR		sizeof(char)
#define DW_SHORT	sizeof(short)
#define DW_LONG		sizeof(long)
#endif

