funlw65/atmega-clib/ATmegaCLib2/atmegaclib2.h
// Control Functions
void GLCD_GotoXY(uint8_t x, uint8_t y);
void GLCD_Init(uint8_t invert);
inline uint8_t GLCD_ReadData(void);
void GLCD_WriteCommand(uint8_t cmd, uint8_t chip);
void GLCD_WriteData(uint8_t data);

#endif //ENABLE_GLCD
//--
#ifdef ENABLE_7SEG
// this is NOT user zone
typedef enum mydigit {
	SELECT_DIGIT_ONE = 1,
	SELECT_DIGIT_TWO = 2,
	SELECT_DIGIT_THREE = 4,
	SELECT_DIGIT_FOUR = 8,
	SELECT_DIGIT_FIVE = 16,
	SELECT_DIGIT_SIX = 32,
	SELECT_DIGIT_SEVEN = 64,
	SELECT_DIGIT_EIGHT = 128
}MyDigit;

// Define the segments
#define SEG_A 0b00000001   //  1
#define SEG_B 0b00000010   //  2
#define SEG_C 0b00000100   //  4
#define SEG_D 0b00001000   //  8
#define SEG_E 0b00010000   // 16
#define SEG_F 0b00100000   // 32
#define SEG_G 0b01000000   // 64
#ifdef SEG_DP_PORT
#define SEG_DP 0b10000000  //128
#endif

void seg_init(void);
uint8_t seg_digit_from_array(uint8_t index);
void seg_nibble(uint8_t);
void seg_common_select(uint8_t);
void seg_select_digit(uint8_t, uint8_t);
#endif //7-seg
//--
#ifdef ENABLE_PCF8583 //it requires Hardware or Software I2C
#ifdef PCF8583_USE_TWI
#ifndef ENABLE_TWI
#error "This needs TWI so, uncomment ENABLE_TWI from library header"
#endif
#endif
uint8_t PCF8583_read(uint8_t address);
void PCF8583_write(uint8_t address, uint8_t data);
uint8_t PCF8583_read_bcd(uint8_t address);
void PCF8583_write_bcd(uint8_t address, uint8_t data);
uint8_t PCF8583_get_status(void);
void PCF8583_init(void);
void PCF8583_stop(void);
void PCF8583_start(void);
void PCF8583_hold_off(void);
void PCF8583_hold_on(void);
void PCF8583_alarm_off(void);
void PCF8583_alarm_on(void);
void PCF8583_write_word(uint8_t address, uint16_t data);
void PCF8583_write_date(uint8_t address, uint8_t day, uint16_t year);
void PCF8583_get_time(uint8_t *hour, uint8_t *min, uint8_t *sec, uint8_t *hsec);
void PCF8583_set_time(uint8_t hour, uint8_t min, uint8_t sec, uint8_t hsec);
void PCF8583_get_date(uint8_t *day, uint8_t *month, uint16_t *year);
void PCF8583_set_date(uint8_t day, uint8_t month, uint16_t year);
void PCF8583_get_alarm_time(uint8_t *hour, uint8_t *min, uint8_t *sec,
		uint8_t *hsec);
void PCF8583_set_alarm_time(uint8_t hour, uint8_t min, uint8_t sec,
		uint8_t hsec);
void PCF8583_get_alarm_date(uint8_t *day, uint8_t *month);
void PCF8583_set_alarm_date(uint8_t day, uint8_t month);
#endif //ENABLE_PCF8583
//Now, the following list of microcontrollers must meet some conditions:
// 1. Must be supported by avr-gcc 4.7.2 and avr-libc 1.8 (svn 2291 or newer)
// 2. Must be supported by avrdude (well, some definitions can be added
//    without problems - e.g., for ATmega88PA starting from ATmega88P).
#if	(defined(__AVR_ATmega48__)   || \
		defined(__AVR_ATmega48P__)     || \
		defined(__AVR_ATmega48PA__)    || \
		defined(__AVR_ATmega88__)      || \
		defined(__AVR_ATmega88P__)     || \
		defined(__AVR_ATmega88PA__)    || \
		defined(__AVR_ATmega168__)     || \
		defined(__AVR_ATmega168P__)    || \
		defined(__AVR_ATmega168PA__)   || \
		defined(__AVR_ATmega328P__)    || \
		defined(__AVR_ATmega16__)      || \
		defined(__AVR_ATmega16A__)     || \
		defined(__AVR_ATmega164P__)    || \
		defined(__AVR_ATmega32__)      || \
		defined(__AVR_ATmega32A__)     || \
		defined(__AVR_ATmega324P__)    || \
		defined(__AVR_ATmega324PA__)   || \
		defined(__AVR_ATmega644__)     || \
		defined(__AVR_ATmega644P__)    || \
		defined(__AVR_ATmega644PA__)   || \
		defined(__AVR_ATmega1284P__)   || \
		defined(__AVR_ATmega1284__)    || \
		defined(__AVR_ATmega2560__)    || \
		defined(__AVR_ATmega1280__))
// Tested with: 168P, 328P, 644P
// TODO: - add "complete" support for ATmega1280 - the last one supported
//         by OptiBoot bootloader. Not so soon, as I don't have yet an
//         Arduino Mega board for tests.
#else
// unsupported type
#error "Processor type not supported in atmegaclib2.c !"
#endif

#if !(F_CPU == 16000000)
#error "Processor speed not supported in atmegaclib2.c !"
#endif

#endif // end file
